<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>El Explorador de Iglesias</title>
<style type="text/css">
<!--
p.Estilo1 {
margin-top:2.0pt;
margin-right:7.2pt;
margin-bottom:3.0pt;
margin-left:0cm;
line-height:12.0pt;
text-autospace:none;
font-size:10.0pt;
font-family:Arial;
}
span.LS1Car {
font-family:Arial;
}
-->
</style>
<style type="text/css">
<!--
p.Estilo12ptIzquierda0cmDerecha-016cm {
margin-top:2.0pt;
margin-right:-4.65pt;
margin-bottom:3.0pt;
margin-left:0cm;
line-height:12.0pt;
text-autospace:none;
font-size:10.0pt;
font-family:Arial;
}
.Estilo2 {color: red}
.Estilo6 {font-size: 10pt}
-->
</style>
<style type="text/css">
<!--
p.H1 {
margin-top:0cm;
margin-right:7.2pt;
margin-bottom:5.2pt;
margin-left:9.0pt;
line-height:12.0pt;
text-autospace:none;
font-size:12.0pt;
font-family:Arial;
color:blue;
font-weight:bold;
}
a:link {
	color: #0000FF;
}
a:visited {
	color: #0000FF;
}
a:hover {
	color: #FF0000;
}
a:active {
	color: #FF0000;
}
-->
</style>
</head>

<body>
<p align="center" class="H1" style="margin-top:0cm;margin-right:0cm;margin-bottom:5.2pt;margin-left:0cm;border:none;padding:0cm;"><font color="#0000FF"><strong>Sobre la Edici&oacute;n</strong></font><strong></font></strong></strong></p>
<hr size="4" />
<p class="Estilo1">Hab&iacute;amos  puesto hasta el momento en las manos de los interesados  dos ediciones de Church - lasptaniSoft versi&oacute;n 1.0.0: </p>
<p class="Estilo1" style="margin-top:2.0pt;margin-right:7.1pt;margin-bottom:3.0pt;margin-left:20.4pt;text-indent:-11.35pt;"><strong>1.</strong> Una edici&oacute;n limitada.<span class="LS1Car"> </span></p>
<p class="Estilo1" style="margin-top:2.0pt;margin-right:7.1pt;margin-bottom:3.0pt;margin-left:20.4pt;text-indent:-11.35pt;"><span class="LS1Car"><strong>2.</strong> U</span>na edici&oacute;n sin l&iacute;mites o libre. </p>
<p class="Estilo1">En la edici&oacute;n limitada se hab&iacute;an eliminado algunas operaciones y  acciones que s&oacute;lo estaban disponibles en la edici&oacute;n libre, adem&aacute;s se hab&iacute;a limitado  la base de datos: no se pod&iacute;an a&ntilde;adir nuevos datos en el explorador de  Iglesias, ni cambiarse los nombres existentes, sin embargo, pod&iacute;a a&ntilde;adir nuevos  miembros o eliminar los existentes sin ninguna dificultad (los miembros que  aparecen son imaginarios). La edici&oacute;n limitada se confeccion&oacute; simplemente para que el  usuario se familiarizara con la aplicaci&oacute;n (programa) y decidiera o no adquirirla.</p>
<p class="Estilo1">La versi&oacute;n libre no ten&iacute;a ninguna limitante, al no ser las que  pose&iacute;a el mismo programa como resultado de su elaboraci&oacute;n.</p>
<p class="Estilo1">Hab&iacute;amos corregido y modificado la versi&oacute;n libre, sali&oacute; por un breve tiempo como versi&oacute;n 1.0.1, en ella cambiamos la manera de <a href="ImportarExportar.html">Importar y Exportar</a> los registros,  el archivo de ayuda fue confeccionado en html para que fuera compatible con las   nuevas versiones de Windows (Vista, 7, etc.),   agregamos en la <a href="BarraBotones.html">Barra de Botones</a> un panel de <a href="BarraBotones.html#buscarpor">b&uacute;squeda r&aacute;pida</a>, y otros detalles que el usuario familiarizado con la aplicaci&oacute;n  not&oacute;. </p>
<p class="Estilo1">En esta ocasi&oacute;n lanzamos la versi&oacute;n 1.0.2, donde hemos unificado la versi&oacute;n de prueba con la versi&oacute; libre, ahora usted adquiere un solo producto, que podr&aacute; usar sin registrar hasta 20 veces con las limitantes de la edici&oacute;n limitada, pero que una vez registrada funcionar&aacute; como edici&oacute;n libre.</p>
<p class="Estilo1">Se han a&ntilde;adidos algunos detalles, entre ellos, la <a href="Configuracion.html">configuraci&oacute;n</a> de la <a href="TablaMaestra.html">Tabla Maestra</a>, ahora esa configuraci&oacute;n queda guardada para que en otras corridas de Church, si lo desea, agilice su trabajo. </p>
<p class="Estilo1">Este programa est&aacute; confeccionado para el registro de la  feligres&iacute;a de la   Iglesia Adventista del S&eacute;ptimo D&iacute;a, no solo en Cuba, sino en  cualquier parte del mundo, y es especialmente &uacute;til para pastores, secretarios  de iglesias, secretarios de delegaciones y para todos aquellos que tengan que  ver con la feligres&iacute;a de la IASD. </p>
<p class="Estilo1">Nota: Cualquier sugerencia o error detectado por favor enviar  mensaje a la siguiente direcci&oacute;n electr&oacute;nica: </p>
<p class="Estilo1" style="text-indent:35.4pt;"><span class="Estilo1" style="text-indent:35.4pt;"><a href="mailto:lsuarez@pp.lt.rimed.cu">lsuarez@pp.lt.rimed.cu</a></span>
<p class="Estilo1" style="text-indent:35.4pt;"><a href="mailto:lasptanisoft44@yahoo.com">lasptanisoft44@yahoo.com</a></p>
<p class="Estilo1" style="text-indent:35.4pt;"><a href="mailto:lasptanisoft44@yahoo.es">	lasptanisoft44@yahoo.es</a></span>
<p class="Estilo1" style="text-indent:27pt;">o telefonear al (0131) <span class="Estilo1" style="text-indent:35.4pt;">5</span>65906, y dejar mensaje. (Delicias, Las Tunas, Cuba). </span> Recordando siempre que debido a posibles cambios o dificultades en la conexi&oacute;n, lo m&aacute;s recomendable es el tel&eacute;fono.
</body>
</html>
