<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>El Explorador de Iglesias</title>
<style type="text/css">
<!--
p.Estilo1 {
margin-top:2.0pt;
margin-right:7.2pt;
margin-bottom:3.0pt;
margin-left:0cm;
line-height:12.0pt;
text-autospace:none;
font-size:10.0pt;
font-family:Arial;
}
span.LS1Car {
font-family:Arial;
}
-->
</style>
<style type="text/css">
<!--
p.Estilo12ptIzquierda0cmDerecha-016cm {
margin-top:2.0pt;
margin-right:-4.65pt;
margin-bottom:3.0pt;
margin-left:0cm;
line-height:12.0pt;
text-autospace:none;
font-size:10.0pt;
font-family:Arial;
}
.Estilo2 {color: red}
.Estilo6 {font-size: 10pt}
-->
</style>
<style type="text/css">
<!--
p.H1 {
margin-top:0cm;
margin-right:7.2pt;
margin-bottom:5.2pt;
margin-left:9.0pt;
line-height:12.0pt;
text-autospace:none;
font-size:12.0pt;
font-family:Arial;
color:blue;
font-weight:bold;
}
a:link {
	color: #0000FF;
}
a:visited {
	color: #0000FF;
}
a:hover {
	color: #FF0000;
}
a:active {
	color: #FF0000;
}
-->
</style>
</head>

<body>
<p align="center" class="H1" style="margin-top:0cm;margin-right:0cm;margin-bottom:5.2pt;margin-left:0cm;border:none;padding:0cm;">El Explorador de Iglesias</p>
<hr size="4" />
<p class="Estilo1">Es aqu&iacute; precisamente donde comienza su trabajo con Church. </p>
<p class="Estilo1">El explorador de Iglesias es igual al explorador de windows,  solo que en vez de carpetas y subcarpetas all&aacute;, aqu&iacute; son datos de las iglesias,  es decir, aunque le llamamos explorador de Iglesias, no solamente contiene  Iglesias, sino tambi&eacute;n: uniones, asociaciones, provincias y distritos en ese  mismo orden, siendo la iglesia lo &uacute;ltimo en a&ntilde;adir.</p>
<p class="Estilo1">Cuando desliza el mouse sobre el explorador de Iglesias,  oprima el bot&oacute;n secundario del rat&oacute;n y aparecer&aacute; el men&uacute; contextual (Figura 2)  que le brinda la oportunidad de comenzar a introducir los primeros datos.</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm">&nbsp;</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm"><img width="636" height="316" src="ExploradorIgl_.jpg" /> </p>
<p class="Estilo1"><span style="color:red; ">Figura 2. </span>El Explorador de  Iglesias.</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1">Le sugerimos colocar el mouse sobre el elemento del cual  depender&aacute; el que est&aacute; a&ntilde;adiendo, de lo contrario algunas opciones aparecer&aacute;n  desactivadas, es decir, los elementos en el explorador son padres e hijos,  excepto Uni&oacute;n que no tiene padre e Iglesia que no tiene hijos al no ser los  miembros de esa iglesia.</p>
<p class="Estilo1">Ejemplo: para a&ntilde;adir una iglesia, se coloca el puntero del  mouse sobre el distrito al cual se est&aacute; a&ntilde;adiendo dicha iglesia, como se  muestra en la figura 3.</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm">&nbsp;</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm"><img width="615" height="313" src="NuevaIgl_.jpg" /></p>
<p class="Estilo1"><span style="color:red; ">Figura 3. </span>A&ntilde;adiendo nueva  iglesia sobre el distrito Puerto Padre.</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1">Como ve solo puede hacer uso de los elementos activos. Puede  a&ntilde;adir una nueva uni&oacute;n y una nueva iglesia, adem&aacute;s de borrar el elemento activo  o todos, para lo cual le pedimos diligencia, es decir, a la hora de borrar debe  tener presente que cuando borra un elemento, se borran todos los elementos que  dependen de &eacute;l, y que dicho borrado no tiene marcha atr&aacute;s, debido a que es una  base de datos relacional, donde un registro tiene varias dependencias.</p>
<p class="Estilo1">Ejemplo: si borra en la figura 3 la Asociaci&oacute;n del Este, se  borrar&aacute; tambi&eacute;n la provincia Las Tunas y el distrito Puerto Padre con todas sus  iglesias y miembros.</p>
<p class="Estilo1">De cualquier manera ning&uacute;n borrado se realizar&aacute; sin una debida  confirmaci&oacute;n.</p>
<p class="Estilo1">A la derecha del t&iacute;tulo del panel Explorador de Iglesias  aparece un bot&oacute;n que toma dos formas:</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1"><img width="11" height="11" src="ExplorMas_.jpg" />&nbsp; Expandir todo el &aacute;rbol del explorador.</p>
<p class="Estilo1"><img width="11" height="5" src="ExplorMenos_.jpg" alt="*" />&nbsp; Contraer todo el &aacute;rbol del explorador.</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1">Cuando a&ntilde;ada iglesias al explorador, &eacute;stas no se activan por  defecto, solo se activar&aacute;n cuando haga doble clic sobre ellas o cuando al estar  seleccionadas oprima la tecla Enter (Return), en este caso el icono de la iglesia  activada cambiar&aacute; por uno similar, pero que evidencia que esa iglesia est&aacute;  abierta.</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1">Nota: Cuando realice <a href="Busqueda.html">b&uacute;squedas</a> Globales o por selecci&oacute;n, el  icono que identifica la iglesia activa desaparece por causa de que la b&uacute;squeda  no se realiz&oacute; en la iglesia activa. </p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm">&nbsp;</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm"><img width="628" height="319" src="IgleSelect_.jpg" /></p>
<p class="Estilo1"><span style="color:red; ">Figura 4.</span> Iglesia seleccionada,  pero no activada.</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm">&nbsp;</p>
<p class="Estilo12ptIzquierda0cmDerecha-016cm"><img width="631" height="321" src="IglSelectActive_.jpg" /> </p>
<p class="Estilo1"><span style="color:red; ">Figura 5.</span> Iglesia seleccionada  y activada.</p>
<p class="Estilo1">&nbsp;</p>
<p class="Estilo1">Al comparar la figura 4 con la figura 5 puede notar la  diferencia, entre lo que es una iglesia seleccionada y una Iglesia activada con  doble clic o Enter. El icono cambi&oacute; y adem&aacute;s se han a&ntilde;adidos todas las  dependencias en el <a href="TablaMaestra.html#panelinformativo">panel informativo</a> que est&aacute; encima de la tabla (marcado en  rojizo e la figura 5).</p>
</body>
</html>
